import pandas as pd

jy_ap_col = [
    "账户", "账号", "券商", "方案一"
]

ns_col = [
    "序号", "账户", "账号", "券商", "交易员"
]

del_list = [
    '申购日',
    '发行价',
    '个人金额',
    '产品金额',
    '备注',
    '个人——获配数量（股）',
    '明湾',
    '金伙伴',
    '民盛系列',
    '潜龙系列',
    '个人',
    '涌赢',
    '涌鑫'
]

add_acc_sec = [
    ["重信", "1780024431", "兴业"],
    ["绿洲2号", "20100028135", "中信"],
    ["暨阳1号", "20100028332", "中信"],
    ["暨阳3号", "20100028337", "中信"],
    ["日新2号", "28091856", "国君"],
    ["日新5号", "20888888", "国君"],
    ["日新14号", "920000229976", "安信"],
    ["巡洋10号", "0830179828", "招商"],
    ["东风12号", "666810000331", "华泰"],
    ["东风16号", "666810018160", "华泰"],
    ["聚财5号", "92102432", "财通"],
    ["银海1号", "100800049296", "银河"],
    ["聚宝6号", "2412042705", "申万"],
    ["合力9号", "666810007686", "华泰"],
    ["月异15号", "1655140260", "申万"],
    ["月异16号", "666810020897",	"华泰"],
    ["聚宝12号", "10926293", "国君"],
    ["东风11号", "666810027978", "华泰"],
    ["征东2号", "666810016272", "华泰"]
]

self_operation = [
    "巡洋3号",
    "潜龙10号",
    "巡洋1号",
    "起航15号",
    "合力1号",
    "合力2号",
    "合力3号",
    "合力16号",
    "龙凤8号"
]


# 表头字典
station_head_dict = {
    "gj": 3,
    "xy": 3,
    "zxjt": 3,
    "zx": [4, 5, 6],
    "zt": 3,
    "ht": [4, 5, 6],
    "zs": [4, 5, 6, 7],
    "df": 3,
    "zj": 3,
    "yh": [4, 5, 6]
}

# 数目在字典中位置
station_num_list_dict = {
    "gj": 2,
    "xy": 2,
    "zxjt": 2,
    "zx": 4,
    "zt": 2,
    "ht": 4,
    "zs": 4,
    "df": 2,
    "zj": 2,
    "yh": 2
}

# 净资产位置
net_asset_loc_dict = {
    "gj": ["基金资产净值:", "市值"],
    "xy": ["基金资产净值:", "市值"],
    "zxjt": ["基金资产净值:", "市值"],
    "zx": ["资产净值", ("市值", "本币", "十亿千百十万千百十元角分")],
    "zt": ["基金资产净值:", "市值"],
    "ht": ["资产净值", ("市值", "本币", "十亿千百十万千百十元角分")],
    "zs": ["资产净值", ("市值-本币", "市值", "本币", "十亿千百十万千百十元角分")],
    "df": ["基金资产净值:", "市值"],
    "zj": ["基金资产净值:", "市值"],
    "yh": ["资产净值", ("市值", "本币", "十亿千百十万千百十元角分")]
}


# 托管平台识别
def station_confirm(file):
    """
    返回托管平台类别，返回值为平台名称拼音首字母
    """
    data = pd.read_excel(file)
    if str(data[data.columns[0]][0]).find('东风6号') > -1:
        return 'zj'
    elif str(data[data.columns[0]][0]).find('中信建投') > -1:
        return 'zxjt'
    elif str(data[data.columns[0]][0]).find('中泰证券股份有限公司') > -1:
        return 'zt'
    elif str(data[data.columns[0]][0]).find('兴业证券') > -1:
        return 'xy'
    elif str(data[data.columns[0]][1]).find('华泰证券') > -1:
        return 'ht'
    elif str(data[data.columns[0]][0]).find('国泰君安') > -1:
        return 'gj'
    elif str(data[data.columns[0]][1]).find('招商证券') > -1:
        return 'zs'
    elif str(data[data.columns[0]][0]).find('东方证券') > -1:
        return 'df'
    elif str(data[data.columns[0]][1]).find('申万宏源证券') > -1:
        return 'sw'
    elif str(data[data.columns[0]][1]).find('银河证券') > -1:
        return 'yh'
    else:
        return 'zx'
